## Intro to Pandas
Pandas is used for Data Analysis. It has functions to analyze, clean, explore and manipulate data.
[source_code](https://github.com/pandas-dev/pandas)

In [2]:
# Importing and giving alias
import numpy as np
import pandas as pd

### DataFrames
Two ways to create datasets in pandas

In [3]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [4]:
df1 = pd.DataFrame(data, columns=columns)
df1

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [5]:
data = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    {
        "Make": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "MSRP": 54990
    },
    {
        "Make": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "MSRP": 34450
    },
    {
        "Make": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        "MSRP": 32340
    }
]

In [6]:
df2 = pd.DataFrame(data)
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [8]:
df2.head(n=2)#Giving n value is the value of rows to be shown.

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

### Pandas Series
A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

Columns in a data frame - series. To access it, use dot or brackets

In [9]:
a = [1, 7, 2]
myvar1 = pd.Series(a)
print(myvar1)
myvar2 = pd.Series(a, index = ["x", "y", "z"])#If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.
print(myvar2)
print(myvar2["y"])# Returning a specific value of specified index
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar3 = pd.Series(calories)
print(myvar3)

0    1
1    7
2    2
dtype: int64
x    1
y    7
z    2
dtype: int64
7
day1    420
day2    380
day3    390
dtype: int64

In [12]:
print(df2.Make)
print(df2["Make"])
print(df2[["Make","Model", "MSRP"]])
print(df2["Make","Model", "MSRP"]) #It will return keyerror as keys given this way returns series.

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object
0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object
      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

KeyError: ('Make', 'Model', 'MSRP')

In [13]:
# Adding column in a dataset
df2['id'] = ['nis1', 'hyu1', 'lot2', 'gmc1', 'nis2']#Values can also be numerical
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,nis1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,hyu1
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,lot2
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,gmc1
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,nis2

In [14]:
del df2['id']
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Indexing

In [15]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df2.Make.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df2.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [18]:
df2.iloc[3]

Make                       GMC
Model                   Acadia
Year                      2017
Engine HP                194.0
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style          4dr SUV
MSRP                     34450
Name: 3, dtype: object

In [23]:
df1.iloc[[2,3,0]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [24]:
df2.iloc[2,3,0]#iloc can return only one value

IndexingError: Too many indexers

In [26]:
#Creating random array
idx = np.arange(5)
np.random.seed(2)
np.random.shuffle(idx)
idx

array([2, 4, 1, 3, 0])

In [27]:
df2.iloc[idx]#Creats a view of main dataset

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [28]:
df2 = df2.iloc[idx]
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

### Label vs Location

In [31]:
df2.iloc[[0,1]]#Returns the value of idex location 0 and 1

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [33]:
df2.loc[[0,1]] #Returns the value of idex lobel 0 and 1

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [36]:
df2 = df2.reset_index(drop=True) #Changing back to the real indexing.
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

### Spliting data

In [37]:
n_train = 3
n_val = 1
n_test = 1
df_train = df2.iloc[:n_train]
df_val = df2.iloc[n_train:n_train+n_val]
df_test = df2.iloc[n_train+n_val:]

In [40]:
df_train

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [41]:
df_val

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

In [42]:
df_test

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

### Element-wise operations

In [44]:
df2['Engine HP']

0    218.0
1    261.0
2      NaN
3    194.0
4    138.0
Name: Engine HP, dtype: float64

In [45]:
df2['Engine HP']*2

0    436.0
1    522.0
2      NaN
3    388.0
4    276.0
Name: Engine HP, dtype: float64

In [46]:
df2['Year'] > 2000

0     True
1     True
2     True
3     True
4    False
Name: Year, dtype: bool

In [48]:
df2['Make'] == 'Nissan'

0    False
1     True
2    False
3    False
4     True
Name: Make, dtype: bool

In [49]:
(df2['Year'] > 2000) & (df2['Make'] == 'Nissan')

0    False
1     True
2    False
3    False
4    False
dtype: bool

### Filtering

In [51]:
df2[df2['Make'] == 'Nissan']

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [52]:
df2[(df2['Year'] > 2010) & (df2['Transmission Type'] == 'AUTOMATIC')]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

### String Operations

In [54]:
df2['Vehicle_Style']

0    convertible
1         Pickup
2          Sedan
3        4dr SUV
4          sedan
Name: Vehicle_Style, dtype: object

In [56]:
df2['Vehicle_Style'].str.lower().str.replace(' ', '_')

0    convertible
1         pickup
2          sedan
3        4dr_suv
4          sedan
Name: Vehicle_Style, dtype: object

In [57]:
df2.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [58]:
df2.columns.str.lower().str.replace(' ', '_')

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp'],
      dtype='object')

In [60]:
df2.columns = df2.columns.str.lower().str.replace(' ', '_')
df2

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [61]:
df2.dtypes #Knowing data types

make                  object
model                 object
year                   int64
engine_hp            float64
engine_cylinders       int64
transmission_type     object
vehicle_style         object
msrp                   int64
dtype: object

In [62]:
df2.dtypes.index #Getting datatypes as an array of index

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp'],
      dtype='object')

In [63]:
df2.dtypes == 'object'

make                  True
model                 True
year                 False
engine_hp            False
engine_cylinders     False
transmission_type     True
vehicle_style         True
msrp                 False
dtype: bool

In [65]:
df2.dtypes[df2.dtypes == 'object'] #Getting all the object type data

make                 object
model                object
transmission_type    object
vehicle_style        object
dtype: object

In [66]:
df2.dtypes[df2.dtypes == 'object'].index

Index(['make', 'model', 'transmission_type', 'vehicle_style'], dtype='object')

In [67]:
list(df2.dtypes[df2.dtypes == 'object'].index) # Getting the data as a list

['make', 'model', 'transmission_type', 'vehicle_style']

In [70]:
# Replacing all the modified value to the original
string_columns = df2.dtypes[df2.dtypes == 'object'].index

for col in string_columns:
    df2[col] = df2[col].str.lower().str.replace(' ', '_')
df2

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.0,4,manual,convertible,54990
1,nissan,frontier,2017,261.0,6,manual,pickup,32340
2,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.0,4,manual,sedan,2000

### Summarizing Operations (EDA)

Numerical columns

In [71]:
df2.msrp

0    54990
1    32340
2    27150
3    34450
4     2000
Name: msrp, dtype: int64

In [72]:
df2.msrp.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: msrp, dtype: float64

In [75]:
df2.mean()

e:\app\Python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

year                 2010.40
engine_hp             202.75
engine_cylinders        4.40
msrp                30186.00
dtype: float64

In [77]:
df2.describe().round(2)

          year  engine_hp  engine_cylinders      msrp
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

Categorical columns

In [79]:
df2.nunique()

make                 4
model                5
year                 3
engine_hp            4
engine_cylinders     2
transmission_type    2
vehicle_style        4
msrp                 5
dtype: int64

In [80]:
df2.make.value_counts()

nissan     2
lotus      1
hyundai    1
gmc        1
Name: make, dtype: int64

### Missing Values

In [81]:
df2.isnull()

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [82]:
df2.isnull().sum()

make                 0
model                0
year                 0
engine_hp            1
engine_cylinders     0
transmission_type    0
vehicle_style        0
msrp                 0
dtype: int64

In [83]:
df2.engine_hp.isnull()

0    False
1    False
2     True
3    False
4    False
Name: engine_hp, dtype: bool

In [84]:
df2.engine_hp.fillna(df2.engine_hp.mean())

0    218.00
1    261.00
2    202.75
3    194.00
4    138.00
Name: engine_hp, dtype: float64

In [85]:
df2.engine_hp = df2.engine_hp.fillna(df2.engine_hp.mean())
df2

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.00,4,manual,convertible,54990
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

### Sorting and re-ordering

In [87]:
df2.sort_values(by='msrp')

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
4,nissan,stanza,1991,138.00,4,manual,sedan,2000
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
0,lotus,elise,2010,218.00,4,manual,convertible,54990

In [88]:
df2.sort_values(by='msrp', ascending=False)

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

In [89]:
df2.sort_values(by='msrp', ascending=True)

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
4,nissan,stanza,1991,138.00,4,manual,sedan,2000
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
0,lotus,elise,2010,218.00,4,manual,convertible,54990

### Grouping

<!--
SELECT
    tranmission_type,
    AVG(msrp)
FROM
    cars
GROUP BY
    transmission_type     -->